In [2]:
import pandas as pd
#my_dict = {
#        'Name': ['Nivedita', 'Mahira', 'Jitendra', 'Maruti'],
#        'Age': [23, 45, 35, 64],
#        'Birth City': ['Mumbai', 'Patna', 'Tuljapur', 'Jalgaon'],
#        'Gender': ['F', 'F', 'M', 'M']
#    }

#df= pd.DataFrame(my_dict)


df = pd.DataFrame.from_dict(
    {
        'Name': ['Nivedita', 'Mahira', 'Jitendra', 'Maruti'],
        'Age': [23, 45, 35, 64],
        'Birth City': ['Mumbai', 'Patna', 'Tuljapur', 'Jalgaon'],
        'Gender': ['F', 'F', 'M', 'M']
    }
)

df

       Name  Age Birth City Gender
0  Nivedita   23     Mumbai      F
1    Mahira   45      Patna      F
2  Jitendra   35   Tuljapur      M
3    Maruti   64    Jalgaon      M

In [3]:
#filtering data from dataframe

age_greater_than_40 =  df[df['Age'] > 40 ] 

age_greater_than_40

     Name  Age Birth City Gender
1  Mahira   45      Patna      F
3  Maruti   64    Jalgaon      M

In [7]:
#multiple column filtering data from dataframe

age_greater_than_40_and_female =  df[ (df['Age'] > 40) &  (df['Gender'] == 'F') ]

age_greater_than_40_and_female

     Name  Age Birth City Gender
1  Mahira   45      Patna      F